public class Main {
    public static void main(String[] args) {
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили
        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        int bonusLimit = 20;
        int ticketPrice = 13_676;
        int bonus = (ticketPrice / bonusLimit);

        System.out.println("Начислено: " + bonus + " мили");

    }
}
